#ifndef TEST_THE_SIZE_DATA_TYPE
#define TEST_THE_SIZE_DATA_TYPE


/**
 * @file test_the_size_data_type.h
 * @brief Заголовок для тестирования размеров типов данных.
 *
 * Содержит объявление функции, проверяющей и выводящей размер типа `long double`.
 */



/**
 * @brief Тестирует и выводит размер типа long double в байтах и битах.
 *
 * Используется для отладки и понимания архитектурных различий.
 * Функция выводит размер `long double` в консоль и возвращает `0`.
 *
 * @return 0 — всегда, используется как индикатор успешного завершения.
 */
int test_the_size_data_type();

#endif